docs: Use mermaid
